accountsservice
acpi
act
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
adwaita-icon-theme
alsa-firmware
alsa-plugins
alsa-utils
ansible
ansiweather
arc-gtk-theme-eos
archlinux-keyring
archlinux-xdg-menu
aria2
asp
atuin
autoconf
automake
autotiling
avizo
b43-fwcutter
base
base-devel
bash-completion
bat
bfs
bind
binutils
bison
bitwarden
blueman
bluez
bluez-utils
bob
bottom
brave-beta-bin
brightnessctl
btop
btrfs-assistant
btrfs-progs
cantarell-fonts
catch2
catppuccin-gtk-theme-latte
chkservice
chromium
circumflex-bin
clang
cliphist-bin
clipman
cpupower
cpupower-gui
cryptsetup
cups
cups-filters
cups-pdf
cutechess
cutechess-cli
debugedit
device-mapper
dhclient
diffutils
discord
dmidecode
dmraid
dnsmasq
docker-buildx
docker-compose
dosfstools
dotnet-sdk-6.0
downgrade
doxygen
dracut
duf
dust
e2fsprogs
edex-ui-bin
efibootmgr
efitools
egl-wayland
element-desktop
endeavouros-keyring
endeavouros-mirrorlist
endeavouros-theming
eog
eos-apps-info
eos-hooks
eos-log-tool
eos-packagelist
eos-qogir-icons
eos-quickstart
eos-rankmirrors
eos-sddm-theme
eos-settings-gnome
eos-update-notifier
erdtree
ethtool
evince
evtest
exfatprogs
eza
f2fs-tools
fakeroot
fcgu-mirrorlist
fd
ffmpegthumbnailer
file
file-roller
findutils
firefox
firewalld
fish
flex
foomatic-db
foomatic-db-engine
foomatic-db-gutenprint-ppds
foomatic-db-nonfree
foomatic-db-nonfree-ppds
foomatic-db-ppds
fprintd
fsarchiver
fwupd
gammastep
gawk
gcc
gdm
gdm-settings
gettext
ghostscript
git
git-delta
github-cli
gitui
glances
glow
gnome-calculator
gnome-console
gnome-control-center
gnome-disk-utility
gnome-keyring
gnome-menus
gnome-nettool
gnome-power-manager
gnome-screenshot
gnome-shell
gnome-shell-extension-dash-to-dock
gnome-shell-extensions
gnome-system-monitor
gnome-text-editor
gnome-themes-extra
gnome-tweaks
gnome-usage
gparted
grc
grep
grim
groff
gsfonts
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
gutenprint
gvfs
gvfs-afc
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-smb
gzip
haveged
hdparm
helix
himalaya
howdy-beta-git
hplip
hplip-plugin
htop
httpie
hub
hwdetect
hwinfo
hyperfine
hyprland
hyprshade
imv-git
inetutils
intel-media-driver
intel-ucode
inxi
iptables-nft
iwd
jfsutils
jq
kernel-install-for-dracut
keyd-git
khal
kitty
lazydocker
lazygit
lemmy-help
less
libdvdcss
libfprint-2-tod1-xps9300-bin
libfprint-tod-git
libgdm
libgsf
libopenraw
libreoffice-fresh
libtool
libva-utils
libwnck3
linux
linux-apfs-rw-dkms-git
linux-enable-ir-emitter
linux-firmware
linux-headers
linux-lts
linux-zen-headers
lld
logrotate
logseq-desktop-bin
lsb-release
lsscsi
lua-language-server
luacheck
luarocks
lvm2
lxappearance
m4
make
mako
man-db
man-pages
mdadm
mdcat
meld
mesa-utils
microsoft-edge-beta-bin
microsoft-edge-dev-bin
mitogen
mlocate
modemmanager
mods
mono-msbuild
mtools
mullvad-vpn-bin
nano
nano-syntax-highlighting
nautilus
nautilus-sendto
navi
needrestart
nemo
neofetch
neovide-git
neovim
neovim-symlinks
nerdfix
netctl
nethack
network-manager-applet
networkmanager
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nilfs-utils
nitch
notion-app
noto-fonts
noto-fonts-emoji
nss-mdns
ntfs-3g
ntp
nwg-look
nwg-panel
omnisharp-roslyn-bin
otf-cascadia-code
p7zip
pacman
pacman-contrib
pamixer
paru
patch
pavucontrol
perl
pipewire-alsa
pipewire-jack
pipewire-pulse
pkgconf
pkgfile
playerctl
plex-media-server
plymouth-theme-arch-glow
podman
podman-compose
pokemon-colorscripts-git
polkit-gnome
poppler-glib
power-profiles-daemon
powerstat
powertop
powertop-auto-tune
prettierd
procs
proxzima-plymouth-git
pv
python
python-capng
python-croniter
python-defusedxml
python-msgpack
python-packaging
python-pipx
python-pyqt5
python-reportlab
python-sentencepiece-git
python-west
qt6-wayland
ranger
rebuild-detector
reflector
reflector-simple
reiserfsprogs
ripgrep
rizin
rofi-lbonn-wayland-git
rofimoji
rsync
rtkit
rtx
ruby
rust-analyzer
rustup
rz-cutter
s-nail
s-tui
safeeyes-git
scrounge-ntfs
seahorse
sed
sg3_utils
shell-color-scripts
slurp
smartmontools
snap-pac
snapper
sof-firmware
splix
spotify-launcher
starship
steam
stockfish
strace
stylua
sudo
sushi
sway
sway-audio-idle-inhibit-git
swayidle
swaylock-effects-git
sysfsutils
system-config-printer
systemd-sysvcompat
tealdeer
testdisk
texinfo
thermald
throttled
tio
tmux
tokei
topgrade
totem
tree
ttf-bitstream-vera
ttf-dejavu
ttf-fira-code
ttf-firacode-nerd
ttf-liberation
ttf-ms-fonts
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
ttf-opensans
ttf-segoe-ui-variable
ttf-victor-mono
ttf-victor-mono-nerd
tuir
unrar
unzip
upower
usb_modeswitch
usbutils
virt-manager
visual-studio-code-bin
vlc
warpd-git
watchexec
waybar-git
welcome
wev
wezterm
wf-recorder-git
wget
which
whitesur-cursor-theme-git
whitesur-gtk-theme
whitesur-icon-theme-git
wireguard-tools
wireplumber
wl-clipboard
wlogout
wlr-randr
wlrctl
wlsunset
wluma
wob
wpa_supplicant
wtype
xdg-desktop-portal-hyprland
xdg-ninja-git
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xed
xf86-input-libinput
xf86-video-intel
xfsprogs
xl2tpd
xorg-server
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkill
xorg-xrandr
xorg-xwininfo
xprintidle
xsane
xsel
xterm
yay
zellij
zfxtop
zoxide
