7zip
accountsservice
acpi
act
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
adw-gtk-theme
adwaita-icon-theme
aerc
ags-hyprpanel-git
alacritty
alsa-firmware
alsa-plugins
alsa-utils
ansible
ansiweather
arc-gtk-theme
archlinux-keyring
archlinux-xdg-menu
aria2
arp-scan
asciiquarium-transparent-git
asp
atuin
autoconf
automake
autotiling
b43-fwcutter
base
base-devel
bash-completion
bat
bat-extras
bfs
bind
binutils
bison
bitwarden
blueman
bluez
bluez-utils
bob
bottles
bottom
brave-beta-bin
brightnessctl
btop
btrfs-assistant
btrfs-progs
bun-bin
caddy
calf
cantarell-fonts
catch2
cava
cbonsai
chafa
chkservice
circumflex-bin
clang
cliphist
clipman
cmatrix
cool-retro-term
cowfortune
cowsay
cryptsetup
ctop
cups
cups-filters
cups-pdf
cv4pve-pepper-git
dart-sass
debugedit
device-mapper
dhclient
dialog
diffutils
discord
dmidecode
dmraid
dnsmasq
docker-buildx
docker-compose
dosbox
dosfstools
dotnet-sdk-6.0
downgrade
doxygen
dracut
duf
dust
e2fsprogs
easyeffects
efibootmgr
efitools
egl-wayland
element-desktop
eog
erdtree
esptool
ethtool
evince
evtest
exfatprogs
expac
eza
f2fs-tools
fakeroot
fastfetch
fd
ffmpegthumbnailer
figlet
file
file-roller
filezilla
findutils
firefox
firewalld
fish
flex
flips
foomatic-db
foomatic-db-engine
foomatic-db-gutenprint-ppds
foomatic-db-nonfree
foomatic-db-nonfree-ppds
foomatic-db-ppds
fprintd
fsarchiver
fswatch
fuseiso
fwupd
fzy
gammastep
gawk
gcc
gdm
gdm-settings
gettext
ghex
ghostscript
ghostty
git
git-delta
github-cli
gitui
glances
glow
gnome-backgrounds
gnome-boxes
gnome-calculator
gnome-console
gnome-control-center
gnome-disk-utility
gnome-keyring
gnome-menus
gnome-multi-writer
gnome-nettool
gnome-power-manager
gnome-screenshot
gnome-shell
gnome-shell-extension-dash-to-dock
gnome-shell-extension-freon-git
gnome-shell-extension-pop-shell-git
gnome-shell-extension-tilingshell
gnome-shell-extensions
gnome-system-monitor
gnome-text-editor
gnome-themes-extra
gnome-tweaks
gnome-usage
gnu-netcat
goread-bin
gparted
gpu-viewer
grc
grep
grim
grimblast-git
groff
gsfonts
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
gtklock
gum
gupnp-tools
gutenprint
gvfs
gvfs-afc
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-smb
gzip
haveged
hdparm
helix
helixbinhx
hexer
hexyl
himalaya
howdy-beta-git
hplip
hplip-plugin
htop
httpie
hub
hwdetect
hwinfo
hyperfine
hypridle
hyprland
hyprland-qtutils
hyprlock
hyprpaper
hyprpicker
hyprshade-git
hyprsunset
hyprutils
imv
inetutils
inotify-tools
intel-gpu-tools
intel-media-driver
intel-ucode
inxi
iotop
iptables-nft
iucode-tool
iwd
java-openjfx-bin
jekyll
jfsutils
jq
just
kakoune
kernel-install-for-dracut
keyd-git
khal
kitty
lazydocker
lazygit
ledger
less
lib32-gnutls
lib32-libogg
lib32-libvorbis
lib32-sdl2-compat
libdvdcss
liberica-jdk-8-full-bin
libfprint-2-tod1-xps9300-bin
libfprint-tod-git
libgdm
libgsf
libopenraw
libqalculate
libreoffice-fresh
libtool
libva-utils
libwnck3
linux
linux-enable-ir-emitter
linux-firmware
linux-headers
linux-lts
lld
logrotate
lolcat
lsb-release
lsp-plugins
lsp-plugins-clap
lsp-plugins-docs
lsp-plugins-ladspa
lsp-plugins-lv2
lsp-plugins-standalone
lsp-plugins-vst
lsscsi
lua-language-server
luacheck
luarocks
lvm2
lxappearance
m4
make
man-db
man-pages
matugen-bin
mdadm
mdcat
meld
mesa-utils
minecraft-launcher
mise-bin
mission-center
mitogen
modemmanager
mods
mono-msbuild
mosh
mousam
mtools
mutagen.io-bin
nano
nano-syntax-highlighting
nautilus
nautilus-sendto
navi
nbtscan
ncdu
needrestart
neo-matrix-git
neofetch
neohtop-bin
neovide
neovim
nerdfix
netctl
nethack
network-manager-applet
networkmanager
networkmanager-openconnect
networkmanager-openvpn
nfs-utils
nilfs-utils
nmap
nodejs
noto-fonts
noto-fonts-emoji
nss-mdns
ntfs-3g
ntp
numbat-bin
nushell
nwg-look
nwg-panel
nyancat
obsidian
onefetch
ookla-speedtest-bin
opencl-nvidia
otf-cascadia-code
ov-bin
pacman
pacman-contrib
pamixer
papirus-icon-theme
paru-git
paru-git-debug
patch
pavucontrol
perl
perl-hash-merge
perl-json
php
pipewire-alsa
pipewire-jack
pipewire-libcamera
pipewire-pulse
pipewire-support
pkgconf
pkgfile
playerctl
plocate
plymouth-theme-arch-glow
podman
podman-compose
pokemon-colorscripts-git
polkit-gnome
poppler-glib
powershell-bin
powerstat
powertop
powertop-auto-tune
pre-commit
prettierd
procs
proton-vpn-gtk-app
proxzima-plymouth-git
pv
python
python-capng
python-croniter
python-defusedxml
python-dlib
python-html2text
python-msgpack
python-packaging
python-pipx
python-poetry
python-pyqt5
python-reportlab
python-tinytuya
qt5-wayland
qt6-wayland
ranger
rclone
rebuild-detector
reflector
reiserfsprogs
retroarch
retroarch-assets-glui
retroarch-assets-ozone
retroarch-assets-xmb
ripgrep
rizin
rofi-wayland
rofimoji
rsync
rtkit
ruby
ruff
rust-analyzer
rustup
rz-cutter
s-nail
s-tui
safeeyes
scrounge-ntfs
seahorse
sed
sg3_utils
shell-color-scripts-git
skim
slurp
smartmontools
snap-pac
snapper
sof-firmware
speech-dispatcher
splix
spotify-launcher
sqlfluff
sqliteman
sshfs
starship
steam
stockfish
strace
stylua
sudo
sushi
swaks
sysfsutils
sysstat
system-config-printer
systemd-sysvcompat
tealdeer
testdisk
texinfo
texlive-binextra
thermald
throttled
tig
tio
tmux
tokei
topgrade
totem
traceroute
tree
tree-sitter-cli
ttf-bitstream-vera
ttf-dejavu
ttf-fira-code
ttf-liberation
ttf-maple
ttf-ms-fonts
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
ttf-opensans
ttf-segoe-ui-variable
ttf-victor-mono
ttf-victor-mono-nerd
tty-clock
tuir
tuned-ppd
typos
ueberzugpp
unrar
unzip
upower
usb_modeswitch
usbutils
uv
vesktop-bin
vim
virt-manager
virt-viewer
visual-studio-code-bin
viu
vlc
watchexec
waybar
wayshot
wev
wezterm
wf-recorder-git
wget
which
whitesur-cursor-theme-git
whitesur-gtk-theme
whitesur-icon-theme-git
wine-mono
wine-staging
winetricks
wireguard-tools
wireplumber
wl-clip-persist
wl-clipboard
wlogout
wlr-randr
wlrctl
wlsunset
wob
wpa_supplicant
wtype
xdg-desktop-portal-hyprland
xdg-ninja-git
xdg-user-dirs
xdg-user-dirs-gtk
xdg-utils
xed
xf86-input-libinput
xf86-video-intel
xfsprogs
xl2tpd
xorg-server
xorg-xdpyinfo
xorg-xinit
xorg-xinput
xorg-xkill
xorg-xrandr
xorg-xwininfo
xsane
xsel
xterm
yazi
yq
zellij
zen-browser-avx2-bin
zen-twilight-avx2-bin
zf-bin
zfxtop
zk
zoom
zoxide
