7zip
accountsservice
acpi
acpid
act
adobe-source-han-sans-cn-fonts
adobe-source-han-sans-jp-fonts
adobe-source-han-sans-kr-fonts
adw-gtk-theme
aider-chat-venv
alacritty
alsa-firmware
alsa-plugins
alsa-tools
alsa-utils
amazon-q-bin
amd-ucode
amdgpu_top
ansible
ansible-aur-git
aria2
aspell
asusctl
asusctltray-upgraded-git
atuin
awesome-terminal-fonts
baobab
base
base-devel
bash-completion
bind
blender
blueman
bluez
bluez-hid2hci
bluez-libs
bluez-utils
bob
bottom
brave-bin
brightnessctl
broot
btop
btrfs-assistant
btrfs-progs
bun-bin
cachyos-fish-config
cachyos-hello
cachyos-hooks
cachyos-kernel-manager
cachyos-keyring
cachyos-micro-settings
cachyos-mirrorlist
cachyos-packageinstaller
cachyos-rate-mirrors
cachyos-settings
cachyos-snapper-support
cachyos-v3-mirrorlist
cachyos-v4-mirrorlist
cachyos-wallpapers
cachyos-zsh-config
calf
cava
chafa
chwd
cliphist
cpupower
cryptsetup
cups
cups-pdf
decibels
deno
device-mapper
dex
dhclient
diffutils
discord
dmidecode
dmraid
dms-shell-git
dnsmasq
dosfstools
downgrade
dua-cli
duf
dust
e2fsprogs
easyeffects
easyeffects-bundy01-presets
efibootmgr
efitools
egl-wayland
eog
epiphany
ethtool
evince
exfatprogs
f2fs-tools
feh
ffmpegthumbnailer
file-roller
firefox
fnm-bin
freecad
fsarchiver
fwupd
gammastep
gedit
ghostty
git
git-delta
github-cli
glances
gnome-backgrounds
gnome-calculator
gnome-calendar
gnome-characters
gnome-clocks
gnome-color-manager
gnome-connections
gnome-console
gnome-contacts
gnome-control-center
gnome-disk-utility
gnome-font-viewer
gnome-keyring
gnome-logs
gnome-maps
gnome-menus
gnome-music
gnome-nettool
gnome-power-manager
gnome-remote-desktop
gnome-screenshot
gnome-session
gnome-settings-daemon
gnome-shell
gnome-shell-extensions
gnome-software
gnome-system-monitor
gnome-terminal
gnome-text-editor
gnome-themes-extra
gnome-tour
gnome-tweaks
gnome-usage
gnome-user-docs
gnome-user-share
gnome-weather
gpu-viewer
grc
greetd
grilo-plugins
grim
grimblast-git
gst-libav
gst-plugin-pipewire
gst-plugin-va
gst-plugins-bad
gst-plugins-ugly
gum
gvfs
gvfs-afc
gvfs-dnssd
gvfs-goa
gvfs-google
gvfs-gphoto2
gvfs-mtp
gvfs-nfs
gvfs-onedrive
gvfs-smb
gvfs-wsdd
haveged
hdparm
howdy-git
hplip
htop
httpie
hub
hwdetect
hwinfo
hyperfine
hypridle
hyprland
hyprlock
hyprpaper
hyprpicker
hyprpolkitagent
hyprsunset
imv
inetutils
inkscape
intel-gpu-tools
iptables-nft
iwd
jamesdsp
jfsutils
journalctl-desktop-notification
just
keyd
khal
kicad
kitty
lazydocker
lazygit
lazyjournal
less
lib32-mesa
lib32-nvidia-utils
lib32-opencl-mesa
lib32-opencl-nvidia
lib32-vulkan-icd-loader
lib32-vulkan-radeon
libdvdcss
libgsf
libnma
libopenraw
libreoffice-fresh
libva-nvidia-driver
libwnck3
limine
limine-mkinitcpio-hook
limine-snapper-sync
linux-cachyos
linux-cachyos-headers
linux-cachyos-lts
linux-cachyos-lts-nvidia-open
linux-cachyos-nvidia-open
linux-firmware
linux-firmware-amdgpu
linux-firmware-cirrus
logrotate
loupe
lsb-release
lsp-plugins-lv2
lsscsi
luacheck
lvm2
malcontent
man-db
man-pages
maplemono-nf
maplemono-ttf
mate-polkit
matugen-bin
mda.lv2
mdadm
mdcat
meld
mermaid-cli
mesa
mesa-utils
micro
microsoft-edge-dev-bin
mkinitcpio
modemmanager
mtools
mutagen.io-bin
nano
nano-syntax-highlighting
nautilus
ncdu
ndisc6
neovim
nerdfix
netctl
networkmanager
networkmanager-openvpn
nfs-utils
nilfs-utils
niri
noto-color-emoji-fontconfig
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
npm
nss-mdns
ntfs-3g
ntp
numbat-bin
nvidia-prime
nvidia-settings
nvidia-utils
nvtop
obsidian
octopi
opencl-mesa
opencl-nvidia
opendesktop-fonts
openssh
orca-slicer-bin
pacman-contrib
papers
paru
pavucontrol
pax-utils
perl
pipewire-alsa
pipewire-libcamera
pipewire-pulse
playerctl
plocate
pnpm
podman
pokemon-colorscripts-git
polkit-gnome
poppler-glib
power-profiles-daemon
procs
pv
pyenv
python
python-defusedxml
python-notify2
python-packaging
python-pipx
python-poetry
python-reportlab
python-uv
python-youtube-transcript-api
qflipper
qt6-wayland
quickshell-git
ranger
rebuild-detector
reflector
ripgrep
rofi
rog-control-center
rsync
rtkit
rustup
rygel
s-nail
safeeyes
sbctl
seahorse
selene
sg3_utils
shell-color-scripts-git
simple-scan
slurp
smartmontools
snapper
snapshot
socat
sof-firmware
speech-dispatcher
spotify-launcher
starship
stylua
sudo
supergfxctl
sushi
switcheroo-control
sysfsutils
system-config-printer
tcpdump
tecla
tectonic
terminus-font
texinfo
tmux
tokei
topgrade
totem
trash-cli
tree-sitter-cli
ttf-bitstream-vera
ttf-dejavu
ttf-fira-code
ttf-firacode-nerd
ttf-liberation
ttf-meslo-nerd
ttf-ms-fonts
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
ttf-opensans
ttf-victor-mono
ttf-victor-mono-nerd
udiskie
ufw
unrar
unzip
upower
usb_modeswitch
usbutils
ventoy-bin
vi
vim
visual-studio-code-bin
vulkan-icd-loader
vulkan-radeon
wev
wezterm
wget
which
wireless-regdb
wireplumber
wl-clip-persist
wlr-randr
wpa_supplicant
xdg-desktop-portal-gnome
xdg-desktop-portal-hyprland
xdg-user-dirs
xdg-user-dirs-gtk
xf86-input-libinput
xf86-video-amdgpu
xfsprogs
xl2tpd
xorg-server
xorg-xdpyinfo
xorg-xeyes
xorg-xhost
xorg-xinit
xorg-xinput
xorg-xkill
xorg-xrandr
xwayland-satellite
yelp
yt-dlp
zam-plugins
zellij
zen-browser-bin
zip
zoxide
