skywind3000/z.lua
jethrokuan/fzf
franciscolourenco/done
dracula/fish
laughedelic/brew-completions
oh-my-fish/plugin-osx
oh-my-fish/plugin-grc
oh-my-fish/plugin-thefuck
